--下列select全部選取後右鍵->在編輯器中設計查詢
SELECT          產品資料.產品編號, 產品類別.說明, 產品類別.類別名稱, 員工.員工編號, 訂貨主檔.客戶編號, 客戶.連絡人
FROM              訂貨主檔 INNER JOIN
                            客戶 ON 訂貨主檔.客戶編號 = 客戶.客戶編號 INNER JOIN
                            訂貨明細 ON 訂貨主檔.訂單號碼 = 訂貨明細.訂單號碼 INNER JOIN
                            員工 ON 訂貨主檔.員工編號 = 員工.員工編號 INNER JOIN
                            產品資料 ON 訂貨明細.產品編號 = 產品資料.產品編號 INNER JOIN
                            供應商 ON 產品資料.供應商編號 = 供應商.供應商編號 INNER JOIN
                            產品類別 ON 產品資料.類別編號 = 產品類別.類別編號 INNER JOIN
                            貨運公司 ON 訂貨主檔.送貨方式 = 貨運公司.貨運公司編號